---
type: LoadComponent
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 5
tags: [revit-api, class]
---

# LoadComponent

`Autodesk.Revit.DB.Structure.LoadComponent` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | LoadComponent | 2016 | `public LoadComponent ( ElementId loadCaseOrCombinationId , double factor )` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | Factor | 2016 | `public double Factor { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | LoadCaseOrCombinationId | 2016 | `public ElementId LoadCaseOrCombinationId { get ; set ; }` |